#include <stdio.h>
/*浮点数储存*/
//int main() {
//	float f = 5.5;
//	//101.1
//	//S = 0
//	//M = 1.011
//	//E = 2^2
//	//存S = 0
//	//存M = 011
//	//存E = 1000 0001
//	//0100 0000 1011 0000 0000 0000 0000 0000
//	//十六进制:0x40b00000
//	printf("%f", f);
//	return 0;
//}

/*函数指针*/
//声明一个函数指针
//typedef void (*Fu_p)(int);
//void shows(int a) {
//	printf("%d\n", a);
//}
//int main() {
//	int a = 30;
//	Fu_p test = NULL;
//	printf("%p\n", shows);
//	test = &shows;
//	printf("%p\n", shows);
//}

/*高低地址,和大小端存储*/
//int main() {
//	int a = 10;//0000 0000 0000 0000 0000 0000 0000 1010
//	//转十六进制:0x0000000a,从左到右分别是高到低
//	int b = a << 2;
//	//0000 0000 0000 0000 0000 0000 0010 1000
//	//0x00000028
//	printf("%d\n", b);
//	int c = b << 2;
//	//0000 0000 0000 0000 0000 0000 1010 0000
//	//0x000000a0
//	printf("%d\n", c);
//	return 0;
//}

/**/
int main() {
	return 0;
}